tap "armmbed/formulae"
tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "gettext"
brew "python@3.9"
brew "libusb"
brew "avrdude"
brew "bootloadhid"
brew "gmp"
brew "cask"
brew "clang-format"
brew "cmake"
brew "cpanminus"
brew "dfu-programmer"
brew "dfu-util"
brew "docker-compose", link: false
brew "expat"
brew "harfbuzz"
brew "ffmpeg"
brew "mpfr"
brew "gawk"
brew "gerbv"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "python@3.10"
brew "graphviz"
brew "isl"
brew "kind"
brew "libmpc"
brew "libxml2"
brew "zlib"
brew "mysql", restart_service: true
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nodebrew"
brew "openjdk"
brew "openjdk@11"
brew "perl"
brew "pyenv"
brew "python@3.8"
brew "qt"
brew "tree"
brew "unar"
brew "uncrustify"
brew "wget"
brew "youtube-dl"
brew "yt-dlp"
brew "zplug"
brew "zsh-completions"
brew "daipeihust/tap/im-select"
brew "osx-cross/arm/arm-gcc-bin@8"
brew "osx-cross/avr/avr-gcc@8", link: true
brew "qmk/qmk/qmk"
cask "3dconnexion"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "arduino"
cask "balenaetcher"
cask "bettertouchtool"
cask "blender"
cask "brave-browser"
cask "cheatsheet"
cask "clipy"
cask "coolterm"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "dropbox"
cask "eagle"
cask "firefox"
cask "freecad"
cask "fujitsu-scansnap-home"
cask "gcc-arm-embedded"
cask "geektool"
cask "gitup"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kicad"
cask "latexit"
cask "mactex-no-gui"
cask "mysqlworkbench"
cask "netspot"
cask "nordic-nrf-connect"
cask "obs"
cask "processing"
cask "qmk-toolbox"
cask "raspberry-pi-imager"
cask "raycast"
cask "scroll-reverser"
cask "sdformatter"
cask "segger-embedded-studio-for-arm"
cask "sequel-ace"
cask "skype"
cask "slack"
cask "steam"
cask "the-unarchiver"
cask "ultimaker-cura"
cask "via"
cask "visual-studio-code"
cask "wireshark"
cask "zoom"
